\! cp -r regress/age_load/data regress/instance/data/age_load
LOAD 'age';
SET search_path TO ag_catalog;
SELECT create_graph('agload_test_graph');
NOTICE:  graph "agload_test_graph" has been created
 create_graph 
--------------
 
(1 row)

SELECT create_vlabel('agload_test_graph','Country');
NOTICE:  VLabel "Country" has been created
 create_vlabel 
---------------
 
(1 row)

SELECT load_labels_from_file('agload_test_graph', 'Country',
    'age_load/countries.csv');
 load_labels_from_file 
-----------------------
 
(1 row)

SELECT create_vlabel('agload_test_graph','City');
NOTICE:  VLabel "City" has been created
 create_vlabel 
---------------
 
(1 row)

SELECT load_labels_from_file('agload_test_graph', 'City',
    'age_load/cities.csv');
 load_labels_from_file 
-----------------------
 
(1 row)

SELECT create_elabel('agload_test_graph','has_city');
NOTICE:  ELabel "has_city" has been created
 create_elabel 
---------------
 
(1 row)

SELECT load_edges_from_file('agload_test_graph', 'has_city',
     'age_load/edges.csv');
 load_edges_from_file 
----------------------
 
(1 row)

SELECT table_catalog, table_schema, lower(table_name) as table_name, table_type
FROM information_schema.tables
WHERE table_schema = 'agload_test_graph' ORDER BY table_name ASC;
   table_catalog    |   table_schema    |    table_name    | table_type 
--------------------+-------------------+------------------+------------
 contrib_regression | agload_test_graph | _ag_label_edge   | BASE TABLE
 contrib_regression | agload_test_graph | _ag_label_vertex | BASE TABLE
 contrib_regression | agload_test_graph | city             | BASE TABLE
 contrib_regression | agload_test_graph | country          | BASE TABLE
 contrib_regression | agload_test_graph | has_city         | BASE TABLE
(5 rows)

SELECT COUNT(*) FROM agload_test_graph."Country";
 count 
-------
    53
(1 row)

SELECT COUNT(*) FROM agload_test_graph."City";
 count 
-------
 72485
(1 row)

SELECT COUNT(*) FROM agload_test_graph."has_city";
 count 
-------
 72485
(1 row)

SELECT COUNT(*) FROM cypher('agload_test_graph', $$MATCH(n) RETURN n$$) as (n agtype);
 count 
-------
 72538
(1 row)

SELECT COUNT(*) FROM cypher('agload_test_graph', $$MATCH (a)-[e]->(b) RETURN e$$) as (n agtype);
 count 
-------
 72485
(1 row)

SELECT create_vlabel('agload_test_graph','Country2');
NOTICE:  VLabel "Country2" has been created
 create_vlabel 
---------------
 
(1 row)

SELECT load_labels_from_file('agload_test_graph', 'Country2',
                             'age_load/countries.csv', false);
 load_labels_from_file 
-----------------------
 
(1 row)

SELECT create_vlabel('agload_test_graph','City2');
NOTICE:  VLabel "City2" has been created
 create_vlabel 
---------------
 
(1 row)

SELECT load_labels_from_file('agload_test_graph', 'City2',
                             'age_load/cities.csv', false);
 load_labels_from_file 
-----------------------
 
(1 row)

SELECT COUNT(*) FROM agload_test_graph."Country2";
 count 
-------
    53
(1 row)

SELECT COUNT(*) FROM agload_test_graph."City2";
 count 
-------
 72485
(1 row)

SELECT id FROM agload_test_graph."Country" LIMIT 10;
       id        
-----------------
 844424930131970
 844424930131971
 844424930131974
 844424930131983
 844424930131989
 844424930131990
 844424930131996
 844424930132002
 844424930132023
 844424930132025
(10 rows)

SELECT id FROM agload_test_graph."Country2" LIMIT 10;
        id        
------------------
 1688849860263937
 1688849860263938
 1688849860263939
 1688849860263940
 1688849860263941
 1688849860263942
 1688849860263943
 1688849860263944
 1688849860263945
 1688849860263946
(10 rows)

SELECT * FROM cypher('agload_test_graph', $$MATCH(n:Country {iso2 : 'BE'})
    RETURN id(n), n.name, n.iso2 $$) as ("id(n)" agtype, "n.name" agtype, "n.iso2" agtype);
      id(n)      |  n.name   | n.iso2 
-----------------+-----------+--------
 844424930131990 | "Belgium" | "BE"
(1 row)

SELECT * FROM cypher('agload_test_graph', $$MATCH(n:Country2 {iso2 : 'BE'})
    RETURN id(n), n.name, n.iso2 $$) as ("id(n)" agtype, "n.name" agtype, "n.iso2" agtype);
      id(n)       |  n.name   | n.iso2 
------------------+-----------+--------
 1688849860263942 | "Belgium" | "BE"
(1 row)

SELECT * FROM cypher('agload_test_graph', $$MATCH(n:Country {iso2 : 'AT'})
    RETURN id(n), n.name, n.iso2 $$) as ("id(n)" agtype, "n.name" agtype, "n.iso2" agtype);
      id(n)      |  n.name   | n.iso2 
-----------------+-----------+--------
 844424930131983 | "Austria" | "AT"
(1 row)

SELECT * FROM cypher('agload_test_graph', $$MATCH(n:Country2 {iso2 : 'AT'})
    RETURN id(n), n.name, n.iso2 $$) as ("id(n)" agtype, "n.name" agtype, "n.iso2" agtype);
      id(n)       |  n.name   | n.iso2 
------------------+-----------+--------
 1688849860263940 | "Austria" | "AT"
(1 row)

SELECT drop_graph('agload_test_graph', true);
NOTICE:  drop cascades to 7 other objects
DETAIL:  drop cascades to table agload_test_graph._ag_label_vertex
drop cascades to table agload_test_graph._ag_label_edge
drop cascades to table agload_test_graph."Country"
drop cascades to table agload_test_graph."City"
drop cascades to table agload_test_graph.has_city
drop cascades to table agload_test_graph."Country2"
drop cascades to table agload_test_graph."City2"
NOTICE:  graph "agload_test_graph" has been dropped
 drop_graph 
------------
 
(1 row)

