/*
 * Copyright 2020 Bitnine Co., Ltd.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
LOAD 'agensgraph';
SET search_path TO ag_catalog;
SELECT create_graph('cypher_create');
NOTICE:  graph "cypher_create" has been created
 create_graph 
--------------
 
(1 row)

SELECT * FROM cypher('cypher_create', $$CREATE ()$$) AS (a agtype);
 a 
---
(0 rows)

-- vertex graphid
SELECT * FROM cypher('cypher_create', $$CREATE (:v)$$) AS (a agtype);
 a 
---
(0 rows)

-- FIXME: these must be replaced with actual CREATE clause implementation
INSERT INTO cypher_create.v DEFAULT VALUES;
INSERT INTO cypher_create.v DEFAULT VALUES;
SELECT * FROM cypher('cypher_create', $$MATCH (n:v) RETURN n$$) AS (n agtype);
                                n                                
-----------------------------------------------------------------
 {"id": 281474976710657, "label": "v", "properties": {}}::vertex
 {"id": 281474976710658, "label": "v", "properties": {}}::vertex
(2 rows)

-- for now, edges are not supported
SELECT * FROM cypher('cypher_create', $$CREATE ()-[]-()$$) AS (a agtype);
ERROR:  edges are not supported in CREATE clause
LINE 1: SELECT * FROM cypher('cypher_create', $$CREATE ()-[]-()$$) A...
                                               ^
-- column definition list for CREATE clause must contain a single agtype
-- attribute
SELECT * FROM cypher('cypher_create', $$CREATE ()$$) AS (a int);
ERROR:  column definition list for CREATE clause must contain a single agtype attribute
LINE 1: SELECT * FROM cypher('cypher_create', $$CREATE ()$$) AS (a i...
                      ^
HINT:  ... cypher($$ ... CREATE ... $$) AS t(c agtype) ...
SELECT * FROM cypher('cypher_create', $$CREATE ()$$) AS (a agtype, b int);
ERROR:  column definition list for CREATE clause must contain a single agtype attribute
LINE 1: SELECT * FROM cypher('cypher_create', $$CREATE ()$$) AS (a a...
                      ^
HINT:  ... cypher($$ ... CREATE ... $$) AS t(c agtype) ...
SELECT drop_graph('cypher_create', true);
NOTICE:  drop cascades to table cypher_create.v
NOTICE:  graph "cypher_create" has been dropped
 drop_graph 
------------
 
(1 row)

