--
-- YB_TABLEGROUP Testsuite: Testing Statments for TABLEGROUP.
--
--
-- pg_catalog alterations. Validate columns of pg_tablegroup and oids.
--
\d pg_tablegroup
            Table "pg_catalog.pg_tablegroup"
   Column   |   Type    | Collation | Nullable | Default
------------+-----------+-----------+----------+---------
 grpname    | name      |           | not null |
 grpowner   | oid       |           | not null |
 grpacl     | aclitem[] |           |          |
 grpoptions | text[]    |           |          |
Indexes:
    "pg_tablegroup_oid_index" PRIMARY KEY, lsm (oid)

SELECT oid, relname, reltype, relnatts FROM pg_class WHERE relname IN ('pg_tablegroup', 'pg_tablegroup_oid_index');
 oid  |         relname         | reltype | relnatts
------+-------------------------+---------+----------
 8000 | pg_tablegroup           |    8002 |        4
 8001 | pg_tablegroup_oid_index |       0 |        1
(2 rows)

SELECT oid, typname, typrelid FROM pg_type WHERE typname LIKE 'pg_tablegroup';
 oid  |    typname    | typrelid
------+---------------+----------
 8002 | pg_tablegroup |     8000
(1 row)

--
-- CREATE TABLEGROUP
--
CREATE TABLEGROUP tgroup1;
CREATE TABLEGROUP tgroup2;
CREATE TABLEGROUP tgroup3;
CREATE TABLE tgroup_test1 (col1 int, col2 int) TABLEGROUP tgroup1;
CREATE TABLE tgroup_test2 (col1 int, col2 int) TABLEGROUP tgroup1;
SELECT grpname FROM pg_tablegroup;
 grpname
---------
 tgroup1
 tgroup2
 tgroup3
(3 rows)

SELECT relname
    FROM (SELECT relname, unnest(reloptions) AS opts FROM pg_class) s
    WHERE opts LIKE '%tablegroup%';
   relname
--------------
 tgroup_test1
 tgroup_test2
(2 rows)

CREATE INDEX ON tgroup_test1(col2);
CREATE TABLE tgroup_test3 (col1 int, col2 int) TABLEGROUP tgroup2;
SELECT relname, relhasindex
    FROM (SELECT relname, relhasindex, unnest(reloptions) AS opts FROM pg_class) s, pg_tablegroup
    WHERE opts LIKE CONCAT('%', CAST(pg_tablegroup.oid AS text), '%');
        relname        | relhasindex
-----------------------+-------------
 tgroup_test1          | t
 tgroup_test2          | f
 tgroup_test1_col2_idx | f
 tgroup_test3          | f
(4 rows)

-- These should fail.
CREATE TABLEGROUP tgroup1;
ERROR:  tablegroup "tgroup1" already exists
CREATE TABLE tgroup_test (col1 int, col2 int) TABLEGROUP bad_tgroupname;
ERROR:  tablegroup "bad_tgroupname" does not exist
CREATE TABLE tgroup_optout (col1 int, col2 int) WITH (colocated=false) TABLEGROUP tgroup1;
ERROR:  cannot use 'colocated=true/false' with tablegroup
CREATE TABLE tgroup_optout (col1 int, col2 int) WITH (colocated=true) TABLEGROUP tgroup1;
ERROR:  cannot use 'colocated=true/false' with tablegroup
CREATE TABLE tgroup_optout (col1 int, col2 int) WITH (colocated=false) TABLEGROUP bad_tgroupname;
ERROR:  tablegroup "bad_tgroupname" does not exist
CREATE TEMP TABLE tgroup_temp (col1 int, col2 int) TABLEGROUP tgroup1;
ERROR:  Cannot use TABLEGROUP with TEMP table.
--
-- Usage of WITH clause or specifying tablegroup name for CREATE INDEX. These all fail.
--
CREATE TABLE tgroup_with (col1 int, col2 int) WITH (tablegroup=123);
ERROR:  Cannot supply tablegroup through WITH clause.
CREATE TABLE tgroup_with (col1 int, col2 int) WITH (tablegroup=123, colocated=true);
ERROR:  Cannot supply tablegroup through WITH clause.
CREATE TABLE tgroup_with (col1 int, col2 int) WITH (tablegroup=123) TABLEGROUP tgroup1;
ERROR:  Cannot supply tablegroup through WITH clause.
CREATE INDEX ON tgroup_test1(col1) WITH (tablegroup=123);
ERROR:  Cannot supply tablegroup through WITH clause.
CREATE INDEX ON tgroup_test1(col1) WITH (tablegroup=123, colocated=true);
ERROR:  Cannot supply tablegroup through WITH clause.
CREATE INDEX ON tgroup_test1(col1) WITH (tablegroup=123) TABLEGROUP tgroup1;
ERROR:  syntax error at or near "TABLEGROUP"
LINE 1: ...INDEX ON tgroup_test1(col1) WITH (tablegroup=123) TABLEGROUP...
                                                             ^
CREATE INDEX ON tgroup_test1(col1) TABLEGROUP tgroup1;
ERROR:  syntax error at or near "TABLEGROUP"
LINE 1: CREATE INDEX ON tgroup_test1(col1) TABLEGROUP tgroup1;
                                           ^
--
-- DROP TABLEGROUP
--
DROP TABLEGROUP tgroup3;
-- These should fail. CREATE TABLE is to check that the row entry was deleted from pg_tablegroup.
CREATE TABLE tgroup_test4 (col1 int, col2 int) TABLEGROUP tgroup3;
ERROR:  tablegroup "tgroup3" does not exist
DROP TABLEGROUP tgroup1;
ERROR:  tablegroup "tgroup1" is not empty
DROP TABLEGROUP bad_tgroupname;
ERROR:  tablegroup "bad_tgroupname" does not exist
-- This drop should work now.
DROP TABLE tgroup_test1;
DROP TABLE tgroup_test2;
DROP TABLEGROUP tgroup1;
-- Create a tablegroup with the name of a dropped tablegroup.
CREATE TABLEGROUP tgroup1;
--
-- Interactions with colocated database.
--
CREATE DATABASE db_colocated colocated=true;
\c db_colocated
-- These should fail.
CREATE TABLEGROUP tgroup1;
ERROR:  cannot use tablegroups in a colocated database
CREATE TABLE tgroup_test (col1 int, col2 int) TABLEGROUP tgroup1;
ERROR:  cannot use tablegroups in a colocated database
CREATE TABLE tgroup_optout (col1 int, col2 int) WITH (colocated=false) TABLEGROUP tgroup1;
ERROR:  cannot use tablegroups in a colocated database
